arduino/Arduino/hardware/lm4f/cores/lm4f/inc/hw_emac.h
//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_MISR1 register.
//
//*****************************************************************************
#define EPHY_MISR1_LINKSTAT     0x00002000  // Change of Link Status Interrupt
#define EPHY_MISR1_SPEED        0x00001000  // Change of Speed Status Interrupt
#define EPHY_MISR1_DUPLEXM      0x00000800  // Change of Duplex Status
                                            // Interrupt
#define EPHY_MISR1_ANC          0x00000400  // Auto-Negotiation Complete
                                            // Interrupt
#define EPHY_MISR1_FCHF         0x00000200  // False Carrier Counter Half-Full
                                            // Interrupt
#define EPHY_MISR1_RXHF         0x00000100  // Receive Error Counter Half-Full
                                            // Interrupt
#define EPHY_MISR1_LINKSTATEN   0x00000020  // Link Status Interrupt Enable
#define EPHY_MISR1_SPEEDEN      0x00000010  // Link Status Interrupt Enable
#define EPHY_MISR1_DUPLEXMEN    0x00000008  // Link Status Interrupt Enable
#define EPHY_MISR1_ANCEN        0x00000004  // Auto-Negotiation Complete
                                            // Interrupt Enable
#define EPHY_MISR1_FCHFEN       0x00000002  // False Carrier Counter Register
                                            // half-full Interrupt Enable
#define EPHY_MISR1_RXHFEN       0x00000001  // Receive Error Counter Register
                                            // Half-Full Event Interrupt

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_MISR2 register.
//
//*****************************************************************************
#define EPHY_MISR2_ANERR        0x00004000  // Auto-Negotiation Error Interrupt
#define EPHY_MISR2_PAGERX       0x00002000  // Page Receive Interrupt
#define EPHY_MISR2_LBFIFO       0x00001000  // Loopback FIFO Overflow/Underflow
                                            // Event Interrupt
#define EPHY_MISR2_MDICO        0x00000800  // MDI/MDIX Crossover Status
                                            // Changed Interrupt
#define EPHY_MISR2_SLEEP        0x00000400  // Sleep Mode Event Interrupt
#define EPHY_MISR2_POLINT       0x00000200  // Polarity Changed Interrupt
#define EPHY_MISR2_JABBER       0x00000100  // Jabber Detect Event Interrupt
#define EPHY_MISR2_ANERREN      0x00000040  // Auto-Negotiation Error Interrupt
                                            // Enable
#define EPHY_MISR2_PAGERXEN     0x00000020  // Page Receive Interrupt Enable
#define EPHY_MISR2_LBFIFOEN     0x00000010  // Loopbalck FIFO
                                            // Overflow/Underflow Interrupt
                                            // Enable
#define EPHY_MISR2_MDICOEN      0x00000008  // MDI/MDIX Crossover Status
                                            // Changed Interrupt Enable
#define EPHY_MISR2_SLEEPEN      0x00000004  // Sleep Mode Event Interrupt
                                            // Enable
#define EPHY_MISR2_POLINTEN     0x00000002  // Polarity Changed Interrupt
                                            // Enable
#define EPHY_MISR2_JABBEREN     0x00000001  // Jabber Detect Event Interrupt
                                            // Enable

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_FCSCR register.
//
//*****************************************************************************
#define EPHY_FCSCR_FCSCNT_M     0x000000FF  // False Carrier Event Counter
#define EPHY_FCSCR_FCSCNT_S     0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_RXERCNT register.
//
//*****************************************************************************
#define EPHY_RXERCNT_RXERRCNT_M 0x0000FFFF  // Receive Error Count
#define EPHY_RXERCNT_RXERRCNT_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BISTCR register.
//
//*****************************************************************************
#define EPHY_BISTCR_PRBSM       0x00004000  // PRBS Single/Continuous Mode
#define EPHY_BISTCR_PRBSPKT     0x00002000  // Generated PRBS Packets
#define EPHY_BISTCR_PKTEN       0x00001000  // Packet Generation Enable
#define EPHY_BISTCR_PRBSCHKLK   0x00000800  // PRBS Checker Lock Indication
#define EPHY_BISTCR_PRBSCHKSYNC 0x00000400  // PRBS Checker Lock Sync Loss
                                            // Indication
#define EPHY_BISTCR_PKTGENSTAT  0x00000200  // Packet Generator Status
                                            // Indication
#define EPHY_BISTCR_PWRMODE     0x00000100  // Sleep Mode Indication
#define EPHY_BISTCR_TXMIILB     0x00000040  // Transmit Data in MII Loop-back
                                            // Mode
#define EPHY_BISTCR_LBMODE_M    0x0000001F  // Loopback Mode Select
#define EPHY_BISTCR_LBMODE_NPCSIN                                             \
                                0x00000001  // Near-end loopback: PCS Input
                                            // Loopback
#define EPHY_BISTCR_LBMODE_NPCSOUT                                            \
                                0x00000002  // Near-end loopback: PCS Output
                                            // Loopback (In 100Base-TX only)
#define EPHY_BISTCR_LBMODE_NDIG 0x00000004  // Near-end loopback: Digital
                                            // Loopback
#define EPHY_BISTCR_LBMODE_NANA 0x00000008  // Near-end loopback: Analog
                                            // Loopback (requires 100 Ohm
                                            // termination)
#define EPHY_BISTCR_LBMODE_FREV 0x00000010  // Far-end Loopback: Reverse
                                            // Loopback

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_LEDCR register.
//
//*****************************************************************************
#define EPHY_LEDCR_BLINKRATE_M  0x00000600  // LED Blinking Rate (ON/OFF
                                            // duration):
#define EPHY_LEDCR_BLINKRATE_20HZ                                             \
                                0x00000000  // 20 Hz (50 ms)
#define EPHY_LEDCR_BLINKRATE_10HZ                                             \
                                0x00000200  // 10 Hz (100 ms)
#define EPHY_LEDCR_BLINKRATE_5HZ                                              \
                                0x00000400  // 5 Hz (200 ms)
#define EPHY_LEDCR_BLINKRATE_2HZ                                              \
                                0x00000600  // 2 Hz (500 ms)

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CTL register.
//
//*****************************************************************************
#define EPHY_CTL_AUTOMDI        0x00008000  // Auto-MDIX Enable
#define EPHY_CTL_FORCEMDI       0x00004000  // Force MDIX
#define EPHY_CTL_PAUSERX        0x00002000  // Pause Receive Negotiated Status
#define EPHY_CTL_PAUSETX        0x00001000  // Pause Transmit Negotiated Status
#define EPHY_CTL_MIILNKSTAT     0x00000800  // MII Link Status
#define EPHY_CTL_BYPLEDSTRCH    0x00000080  // Bypass LED Stretching

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_10BTSC register.
//
//*****************************************************************************
#define EPHY_10BTSC_RXTHEN      0x00002000  // Lower Receiver Threshold Enable
#define EPHY_10BTSC_SQUELCH_M   0x00001E00  // Squelch Configuration
#define EPHY_10BTSC_NLPDIS      0x00000080  // NLP Transmission Control
#define EPHY_10BTSC_POLSTAT     0x00000010  // 10 Mb Polarity Status
#define EPHY_10BTSC_JABBERD     0x00000001  // Jabber Disable
#define EPHY_10BTSC_SQUELCH_S   9

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BICSR1 register.
//
//*****************************************************************************
#define EPHY_BICSR1_ERRCNT_M    0x0000FF00  // BIST Error Count
#define EPHY_BICSR1_IPGLENGTH_M 0x000000FF  // BIST IPG Length
#define EPHY_BICSR1_ERRCNT_S    8
#define EPHY_BICSR1_IPGLENGTH_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_BICSR2 register.
//
//*****************************************************************************
#define EPHY_BICSR2_PKTLENGTH_M 0x000007FF  // BIST Packet Length
#define EPHY_BICSR2_PKTLENGTH_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDCR register.
//
//*****************************************************************************
#define EPHY_CDCR_START         0x00008000  // Cable Diagnostic Process Start
#define EPHY_CDCR_LINKQUAL_M    0x00000300  // Link Quality Indication
#define EPHY_CDCR_LINKQUAL_GOOD 0x00000100  // Good Quality Link Indication
#define EPHY_CDCR_LINKQUAL_MILD 0x00000200  // Mild Quality Link Indication
#define EPHY_CDCR_LINKQUAL_POOR 0x00000300  // Poor Quality Link Indication
#define EPHY_CDCR_DONE          0x00000002  // Cable Diagnostic Process Done
#define EPHY_CDCR_FAIL          0x00000001  // Cable Diagnostic Process Fail

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_RCR register.
//
//*****************************************************************************
#define EPHY_RCR_SWRST          0x00008000  // Software Reset
#define EPHY_RCR_SWRESTART      0x00004000  // Software Restart

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_LEDCFG register.
//
//*****************************************************************************
#define EPHY_LEDCFG_LED2_M      0x00000F00  // LED2 Configuration
#define EPHY_LEDCFG_LED2_LINK   0x00000000  // Link OK
#define EPHY_LEDCFG_LED2_RXTX   0x00000100  // RX/TX Activity
#define EPHY_LEDCFG_LED2_TX     0x00000200  // TX Activity
#define EPHY_LEDCFG_LED2_RX     0x00000300  // RX Activity
#define EPHY_LEDCFG_LED2_COL    0x00000400  // Collision
#define EPHY_LEDCFG_LED2_100BT  0x00000500  // 100-Base TX
#define EPHY_LEDCFG_LED2_10BT   0x00000600  // 10-Base TX
#define EPHY_LEDCFG_LED2_FD     0x00000700  // Full Duplex
#define EPHY_LEDCFG_LED2_LINKTXRX                                             \
                                0x00000800  // Link OK/Blink on TX/RX Activity
#define EPHY_LEDCFG_LED1_M      0x000000F0  // LED1 Configuration
#define EPHY_LEDCFG_LED1_LINK   0x00000000  // Link OK
#define EPHY_LEDCFG_LED1_RXTX   0x00000010  // RX/TX Activity
#define EPHY_LEDCFG_LED1_TX     0x00000020  // TX Activity
#define EPHY_LEDCFG_LED1_RX     0x00000030  // RX Activity
#define EPHY_LEDCFG_LED1_COL    0x00000040  // Collision
#define EPHY_LEDCFG_LED1_100BT  0x00000050  // 100-Base TX
#define EPHY_LEDCFG_LED1_10BT   0x00000060  // 10-Base TX
#define EPHY_LEDCFG_LED1_FD     0x00000070  // Full Duplex
#define EPHY_LEDCFG_LED1_LINKTXRX                                             \
                                0x00000080  // Link OK/Blink on TX/RX Activity
#define EPHY_LEDCFG_LED0_M      0x0000000F  // LED0 Configuration
#define EPHY_LEDCFG_LED0_LINK   0x00000000  // Link OK
#define EPHY_LEDCFG_LED0_RXTX   0x00000001  // RX/TX Activity
#define EPHY_LEDCFG_LED0_TX     0x00000002  // TX Activity
#define EPHY_LEDCFG_LED0_RX     0x00000003  // RX Activity
#define EPHY_LEDCFG_LED0_COL    0x00000004  // Collision
#define EPHY_LEDCFG_LED0_100BT  0x00000005  // 100-Base TX
#define EPHY_LEDCFG_LED0_10BT   0x00000006  // 10-Base TX
#define EPHY_LEDCFG_LED0_FD     0x00000007  // Full Duplex
#define EPHY_LEDCFG_LED0_LINKTXRX                                             \
                                0x00000008  // Link OK/Blink on TX/RX Activity

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ALCDCR register.
//
//*****************************************************************************
#define EPHY_ALCDCR_ALCDSTART   0x00008000  // Start ALCD
#define EPHY_ALCDCR_ALCDDONE    0x00001000  // TPTD Diagnostic Bypass
#define EPHY_ALCDCR_ALCDOUT1_M  0x00000FF0  // ALCD Output 1
#define EPHY_ALCDCR_ALCDCTRL_M  0x00000007  // ALCD Control
#define EPHY_ALCDCR_ALCDOUT1_S  4
#define EPHY_ALCDCR_ALCDCTRL_S  0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDSCR register.
//
//*****************************************************************************
#define EPHY_CDSCR_CROSSTDR     0x00004000  // Cross TDR Diagnostic Mode
#define EPHY_CDSCR_TPTDBYP      0x00002000  // TPTD Diagnostic Bypass
#define EPHY_CDSCR_TPRDBYP      0x00001000  // TPRD Diagnostic Bypass
#define EPHY_CDSCR_AVGCYC_M     0x00000700  // Number of TDR Cycles to Average
#define EPHY_CDSCR_AVGCYC_1     0x00000000  // 1 TDR cycle
#define EPHY_CDSCR_AVGCYC_2     0x00000100  // 2 TDR cycle
#define EPHY_CDSCR_AVGCYC_4     0x00000200  // 4 TDR cycle
#define EPHY_CDSCR_AVGCYC_8     0x00000300  // 8 TDR cycle
#define EPHY_CDSCR_AVGCYC_16    0x00000400  // 16 TDR cycle
#define EPHY_CDSCR_AVGCYC_32    0x00000500  // 32 TDR cycle
#define EPHY_CDSCR_AVGCYC_64    0x00000600  // 64 TDR cycle

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLR1 register.
//
//*****************************************************************************
#define EPHY_CDLR1_TPTDPL2_M    0x0000FF00  // TPTD Peak Location 2
#define EPHY_CDLR1_TPTDPL1_M    0x000000FF  // TPTD Peak Location 1
#define EPHY_CDLR1_TPTDPL2_S    8
#define EPHY_CDLR1_TPTDPL1_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLR2 register.
//
//*****************************************************************************
#define EPHY_CDLR2_TPTDPL4_M    0x0000FF00  // TPTD Peak Location 4
#define EPHY_CDLR2_TPTDPL3_M    0x000000FF  // TPTD Peak Location 3
#define EPHY_CDLR2_TPTDPL4_S    8
#define EPHY_CDLR2_TPTDPL3_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLR3 register.
//
//*****************************************************************************
#define EPHY_CDLR3_TPRDPL1_M    0x0000FF00  // TPRD Peak Location 1
#define EPHY_CDLR3_TPTDPL5_M    0x000000FF  // TPTD Peak Location 5
#define EPHY_CDLR3_TPRDPL1_S    8
#define EPHY_CDLR3_TPTDPL5_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLR4 register.
//
//*****************************************************************************
#define EPHY_CDLR4_TPRDPL3_M    0x0000FF00  // TPRD Peak Location 3
#define EPHY_CDLR4_TPRDPL2_M    0x000000FF  // TPRD Peak Location 2
#define EPHY_CDLR4_TPRDPL3_S    8
#define EPHY_CDLR4_TPRDPL2_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLR5 register.
//
//*****************************************************************************
#define EPHY_CDLR5_TPRDPL5_M    0x0000FF00  // TPRD Peak Location 5
#define EPHY_CDLR5_TPRDPL4_M    0x000000FF  // TPRD Peak Location 4
#define EPHY_CDLR5_TPRDPL5_S    8
#define EPHY_CDLR5_TPRDPL4_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLAR1 register.
//
//*****************************************************************************
#define EPHY_CDLAR1_TPTDPA2_M   0x00007F00  // TPTD Peak Amplitude 2
#define EPHY_CDLAR1_TPTDPA1_M   0x0000007F  // TPTD Peak Amplitude 1
#define EPHY_CDLAR1_TPTDPA2_S   8
#define EPHY_CDLAR1_TPTDPA1_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLAR2 register.
//
//*****************************************************************************
#define EPHY_CDLAR2_TPTDPA4_M   0x00007F00  // TPTD Peak Amplitude 4
#define EPHY_CDLAR2_TPTDPA3_M   0x0000007F  // TPTD Peak Amplitude 3
#define EPHY_CDLAR2_TPTDPA4_S   8
#define EPHY_CDLAR2_TPTDPA3_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLAR3 register.
//
//*****************************************************************************
#define EPHY_CDLAR3_TPRDPA1_M   0x00007F00  // TPTD Peak Amplitude 1
#define EPHY_CDLAR3_TPTDPA5_M   0x0000007F  // TPTD Peak Amplitude 5
#define EPHY_CDLAR3_TPRDPA1_S   8
#define EPHY_CDLAR3_TPTDPA5_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLAR4 register.
//
//*****************************************************************************
#define EPHY_CDLAR4_TPRDPA3_M   0x00007F00  // TPRD Peak Amplitude 3
#define EPHY_CDLAR4_TPRDPA2_M   0x0000007F  // TPRD Peak Amplitude 2
#define EPHY_CDLAR4_TPRDPA3_S   8
#define EPHY_CDLAR4_TPRDPA2_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDLAR5 register.
//
//*****************************************************************************
#define EPHY_CDLAR5_TPRDPA5_M   0x00007F00  // TPRD Peak Amplitude 5
#define EPHY_CDLAR5_TPRDPA4_M   0x0000007F  // TPRD Peak Amplitude 4
#define EPHY_CDLAR5_TPRDPA5_S   8
#define EPHY_CDLAR5_TPRDPA4_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_CDGRR register.
//
//*****************************************************************************
#define EPHY_CDGRR_TPTDPP5      0x00008000  // TPTD Peak Polarity 5
#define EPHY_CDGRR_TPTDPP4      0x00004000  // TPTD Peak Polarity 4
#define EPHY_CDGRR_TPTDPP3      0x00002000  // TPTD Peak Polarity 3
#define EPHY_CDGRR_TPTDPP2      0x00001000  // TPTD Peak Polarity 2
#define EPHY_CDGRR_TPTDPP1      0x00000800  // TPTD Peak Polarity 1
#define EPHY_CDGRR_TPRDPP5      0x00000400  // TPRD Peak Polarity 5
#define EPHY_CDGRR_TPRDPP4      0x00000200  // TPRD Peak Polarity 4
#define EPHY_CDGRR_TPRDPP3      0x00000100  // TPRD Peak Polarity 3
#define EPHY_CDGRR_TPRDPP2      0x00000080  // TPRD Peak Polarity 2
#define EPHY_CDGRR_TPRDPP1      0x00000040  // TPRD Peak Polarity 1
#define EPHY_CDGRR_CDTPTD       0x00000020  // Cross Reflection were detected
                                            // on TPTD
#define EPHY_CDGRR_CDTPRD       0x00000010  // Cross Reflection were detected
                                            // on TPRD
#define EPHY_CDGRR_AB5TPTDP     0x00000008  // More than 5 reflections were
                                            // detected on TPTD
#define EPHY_CDGRR_AB5TPRDP     0x00000004  // More than 5 reflections were
                                            // detected on TPRD

//*****************************************************************************
//
// The following are defines for the bit fields in the EPHY_ALCDR2 register.
//
//*****************************************************************************
#define EPHY_ALCDR2_ALCDOUT2_M  0x0000F000  // ALCD Output 2
#define EPHY_ALCDR2_ALCDOUT3_M  0x00000FFF  // ALCD Output 2
#define EPHY_ALCDR2_ALCDOUT2_S  12
#define EPHY_ALCDR2_ALCDOUT3_S  0

#endif // __HW_EMAC_H__
